Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: the first, experimental release of a package
pl: pierwsze, eksperymentalne wydanie pakietu

source: the second alpha release of the first patch version of 1.0
pl: drugie wydanie alpha pierwszej łatki w wersji 1.0

source: :option:`classifiers` are specified in a Python list::
pl: Opcja :option:`classifiers` jest określona w liście pytonowskiej::

source: If you wish to include classifiers in your :file:`setup.py` file and also wish to remain backwards-compatible with Python releases prior to 2.2.3, then you can include the following code fragment in your :file:`setup.py` before the :func:`setup` call. ::
pl: Jeśli chcesz załączyć klasyfikatory w pliku :file:`setup.py` ale także chcesz zachować wsteczną zgodność z wydaniami języka pytonowskiego sprzed wersji 2.2.3, wtedy możesz załączyć następujący fragment kodu w twoim pliku :file:`setup.py` przed wywołaniem :func:`setup` ::

source: # patch distutils if it can't cope with the "classifiers" or # "download_url" keywords from sys import version if version < '2.2.3': from distutils.dist import DistributionMetadata DistributionMetadata.classifiers = None DistributionMetadata.download_url = None
pl: #łatka distutils jeśli nie da się poradzić sobie z "klasyfikatorami" lub # słowa kluczowe "download_url" from sys import version if version < '2.2.3':from distutils.dist import DistributionMetadata DistributionMetadata.classifiers = None DistributionMetadata.download_url = None

source: Debugging the setup script
pl: Odpluskwianie skryptu instalacyjnego

source: Sometimes things go wrong, and the setup script doesn't do what the developer wants.
pl: Czasami sprawy źle idą, i skrypt instalacyjny nie robi tego czego chce twórca oprogramowania.

source: Distutils catches any exceptions when running the setup script, and print a simple error message before the script is terminated. The motivation for this behaviour is to not confuse administrators who don't know much about Python and are trying to install a package. If they get a big long traceback from deep inside the guts of Distutils, they may think the package or the Python installation is broken because they don't read all the way down to the bottom and see that it's a permission problem.
pl: Distutils przechwytuje wszelkie wyjątki gdy uruchamiasz skrypt instalacyjny, i wypisuje prosty komunikat o błędzie zanim skrypt zostanie zakończony. Motywacją dla tego zachowania jest to aby nie wprowadzać zamieszania administratora który nie wie za wiele o języku pytonowskim i próbuje zainstalować pakiet. Jeśli dostanie długi duży wypis z głębi gardzieli Distutils, mogą pomyśleć że pakiet lub instalacja języka pytonowskiego jest popsuta gdyż nie przeczytali wszystkiego do dna i będą sądzić że jest to błąd dostępu.

source: On the other hand, this doesn't help the developer to find the cause of the failure. For this purpose, the DISTUTILS_DEBUG environment variable can be set to anything except an empty string, and distutils will now print detailed information what it is doing, and prints the full traceback in case an exception occurs.
pl: Z drugiej strony, nie pomaga to twórcom znaleźć przyczyny błędu. Z tego powodu, zmienna środowiskowa DISTUTILS_DEBUG może zostać ustawiona na cokolwiek prócz pustego ciągu znaków, a distutils będzie teraz drukował rozbudowane informacje co się dzieje, i drukował pełen wypis w przypadku gdy nastąpi wyjątek.

source: Creating a Source Distribution
pl: Tworzenie dystrybucji źródłowej

source: As shown in section :ref:`distutils-simple-example`, you use the :command:`sdist` command to create a source distribution. In the simplest case, ::
pl: Jak pokazano w rozdziale :ref:`distutils-simple-example`, używasz polecenia :command:`sdist` aby utworzyć dystrybucję źródłową. W najprostszym przypadku, ::

source: (assuming you haven't specified any :command:`sdist` options in the setup script or config file), :command:`sdist` creates the archive of the default format for the current platform. The default format is a gzip'ed tar file (:file:`.tar.gz`) on Unix, and ZIP file on Windows.
pl: (zakładając że nie ustaliłeś żadnych opcji polecenia :command:`sdist`w skrypcie instalacyjnym lub pliku konfiguracyjnym), polecenie :command:`sdist` tworzy archiwum domyślnego formatu dla danej maszyny/środowiska. Domyślnym formatem jest zgzipowany plik tar (:file:`.tar.gz`) na Unixie i plik ZIP na Windows.

source: You can specify as many formats as you like using the :option:`--formats` option, for example::
pl: Możesz określić tak wiele formatów jak uważasz za stosowne używając opcji :option:`--formats`, na przykład::

source: to create a gzipped tarball and a zip file. The available formats are:
pl: aby utworzyć zgzipowany tarball i plik zip. Dostępne formaty to:

source: gzip'ed tar file (:file:`.tar.gz`)
pl: zgzipowany plik tar (:file:`.tar.gz`)

source: bzip2'ed tar file (:file:`.tar.bz2`)
pl: zbzip2owany plik tar (:file:`.tar.bz2`)

source: requires the :program:`compress` program. Notice that this format is now pending for deprecation and will be removed in the future versions of Python.
pl: wymaga programu kompresji :program:`compress`. Zauważ że ten format oczekuje teraz na przedawnienie i zostanie zdjęty w przyszłych wersjach języka pytonowskiego.

source: When using any ``tar`` format (``gztar``, ``bztar``, ``ztar`` or ``tar``) under Unix, you can specify the ``owner`` and ``group`` names that will be set for each member of the archive.
pl: Gdy używa się jakiegokolwiek formatu ``tar`` (``gztar``, ``bztar``, ``ztar`` lub ``tar``) pod Unix-em, można określić nazwy ``właściciela`` i ``grupy`` które zostaną ustawione dla każdego członka archiwum.

source: For example, if you want all files of the archive to be owned by root::
pl: Dla przykładu, gdy chcesz aby wszystkie pliki archiwum były posiadane przez roota::

source: Specifying the files to distribute
pl: Określanie plików do rozprowadzenia

source: If you don't supply an explicit list of files (or instructions on how to generate one), the :command:`sdist` command puts a minimal default set into the source distribution:
pl: Jeśli nie dostarczasz jawnej listy plików (lub instrukcji jak ją wygenerować), polecenie :command:`sdist` wkłada minimalny zbiór domyślny w dystrybucję źródeł:

source: all Python source files implied by the :option:`py_modules` and :option:`packages` options
pl: wszystkie pliki źródłowe języka pytonowskiego wynikłe niejawnie z opcji :option:`py_modules` i opcji :option:`packages`

source: all C source files mentioned in the :option:`ext_modules` or :option:`libraries` options (
pl: wszystkie pliki źródłowe C wspomniane w opcjach :option:`ext_modules` lub :option:`libraries`

source: **\*\*** getting C library sources currently broken---no :meth:`get_source_files` method in :file:`build_clib.py`! **\*\***)
pl: **\*\*** uzyskanie źródeł biblioteki C obecnie zepsute---brak sposobu postępowania :meth:`get_source_files` w pliku :file:`build_clib.py`! **\*\***)

source: scripts identified by the :option:`scripts` option See :ref:`distutils-installing-scripts`.
pl: skrypty zidentyfikowane przez opcję :option:`scripts` Zobacz :ref:`distutils-installing-scripts`.

source: anything that looks like a test script: :file:`test/test\*.py` (currently, the Distutils don't do anything with test scripts except include them in source distributions, but in the future there will be a standard for testing Python module distributions)
pl: cokolwiek co wygląda jak skrypt testujący: plik :file:`test/test\*.py` (obecnie Distutils nie robi nic ze skryptami testowymi z wyjątkiem załączania ich w dystrybucji źródeł, ale w przyszłości będzie standard dla testowania dystrybucji modułów języka pytonowskiego)

source: :file:`README.txt` (or :file:`README`), :file:`setup.py` (or whatever you called your setup script), and :file:`setup.cfg`
pl: plik :file:`README.txt (lub plik :file:`README`), plik :file:`setup.py` (lub jakkolwiek nazwałeś swój skrypt), i plik :file:`setup.cfg`

source: all files that matches the ``package_data`` metadata. See :ref:`distutils-installing-package-data`.
pl: wszystkie pliki które odpowiadają danym-o-danych ``package_data``. Zobacz :ref:`distutils-installing-package-data` - z ang. -:ref:`instalowanie-danych-pakietu-z-distutils`.

source: all files that matches the ``data_files`` metadata. See :ref:`distutils-additional-files`.
pl: wszystkie pliki które odpowiadają danym-o-danych ``data_files``. Zobacz :ref:`distutils-additional-files` - z ang. - :ref:`dodatkowe-pliki-distutils`.

source: Sometimes this is enough, but usually you will want to specify additional files to distribute. The typical way to do this is to write a *manifest template*, called :file:`MANIFEST.in` by default. The manifest template is just a list of instructions for how to generate your manifest file, :file:`MANIFEST`, which is the exact list of files to include in your source distribution. The :command:`sdist` command processes this template and generates a manifest based on its instructions and what it finds in the filesystem.
pl: Czasem to jest wystarczające, ale zwykle potrzebujesz określić dodatkowe pliki do rozprowadzenia. Typowym sposobem robienia tego jest napisanie *wzoru manifestu* - z ang. - *manifest template* zwanego :file:`MANIFEST.in` domyślnie. Wzór manifestu jest po prostu listą instrukcji na to jak wygenerować plik manifestu, :file:`MANIFEST`, który jest dokładnie listą plików do włączenia w twoją dystrybucję źródłową. Polecenie :command:`sdist` przetwarza ten wzorzec i wytwarza manifest w oparciu o jego instrukcje i to, co znajdzie w systemie plików.

source: If you prefer to roll your own manifest file, the format is simple: one filename per line, regular files (or symlinks to them) only. If you do supply your own :file:`MANIFEST`, you must specify everything: the default set of files described above does not apply in this case.
pl: Jeśli wolisz napisać swój własny plik manifestu, format jest prosty: jedna nazwa pliku na linię, jedynie pliki zwyczajne (lub symboliczne odwołania do nich). Jeżeli dostarczysz swój własny plik :file:`MANIFEST`, musisz określić wszystko: domyślny zbiór plików opisujących powyższe nie odnosi się do tego przypadku.

source: See :ref:`manifest_template` section for a syntax reference.
pl: Sięgnij do rozdziału :ref:`wzór_manifestu` po opis podręczny składni.

source: Manifest-related options
pl: Związane-z-Manifestem opcje

source: The normal course of operations for the :command:`sdist` command is as follows:
pl: Normalny kurs operacji polecenia :command:`sdist` jest następujący:

source: if the manifest file, :file:`MANIFEST` doesn't exist, read :file:`MANIFEST.in` and create the manifest
pl: Jeśli plik manifestu, :file:`MANIFEST` nie istnieje, przeczytaj plik :file:`MANIFEST.in` i utwórz manifest

source: if neither :file:`MANIFEST` nor :file:`MANIFEST.in` exist, create a manifest with just the default file set
pl: Jeśli żaden z plików :file:`MANIFEST` ani :file:`MANIFEST.in` nie istnieją, stwórz manifest tylko z domyślnym zestawem plików

source: if either :file:`MANIFEST.in` or the setup script (:file:`setup.py`) are more recent than :file:`MANIFEST`, recreate :file:`MANIFEST` by reading :file:`MANIFEST.in`
pl: Jeśli obojętnie który plik z :file:`MANIFEST.in` lub skryptu instalacyjnego (:file:`setup.py`) są bardziej niedawno utworzone niż plik :file:`MANIFEST`, odtwórz plik :file:`MANIFEST` przez przeczytanie pliku :file:`MANIFEST.in`

source: use the list of files now in :file:`MANIFEST` (either just generated or read in) to create the source distribution archive(s)
pl: użyj listy plików teraz znajdujących się w pliku :file:`MANIFEST` (albo dopiero co wygenerowanych albo wczytanych) do utworzenia archiwum(/ów) dystrybucji źródłowej

source: There are a couple of options that modify this behaviour. First, use the :option:`--no-defaults` and :option:`--no-prune` to disable the standard "include" and "exclude" sets.
pl: Istnieje parę opcji które modyfikują to zachowanie. Po pierwsze, użyj opcji :option:`--no-defaults` i opcji :option:`--no-prune` aby wyłączyć standardowe zbiory załączane i wyłączane.

source: Second, you might just want to (re)generate the manifest, but not create a source distribution::
pl: Po drugie możesz po prostu chcieć wygenerować (powtórnie) manifest, ale nie tworzyć dystrybucji źródłowej::

source: :option:`-o` is a sortcut for :option:`--manifest-only`.
pl: opcja :option:`-o` jest skrótem opcji :option:`--manifest-only` z ang. - --tylko-manifest.

source: The MANIFEST.in template
pl: wzór MANIFEST.in

source: A :file:`MANIFEST.in` file can be added in a project to define the list of files to include in the distribution built by the :command:`sdist` command.
pl: Plik :file:`MANIFEST.in` może być dodany w projekcie do definiowania listy plików do załączenia w dystrybucji zbudowanej przez polecenie :command:`sdist`.

source: When :command:`sdist` is run, it will look for the :file:`MANIFEST.in` file and interpret it to generate the :file:`MANIFEST` file that contains the list of files that will be included in the package.
pl: Gdy polecenie :command:`sdist` jest uruchamiane, będzie szukało pliku :file:`MANIFEST.in` i interpretowało go aby wygenerować plik :file:`MANIFEST`, który zawiera listę plików, które będą załączone w pakiecie.

source: This mechanism can be used when the default list of files is not enough. (See :ref:`manifest`).
pl: Ten mechanizm może być używany gdy domyślna lista plików nie wystarcza. (Zobacz :ref:`manifest`).

source: Principle
pl: Zasada

source: The manifest template has one command per line, where each command specifies a set of files to include or exclude from the source distribution. For an example, let's look at the Distutils' own manifest template::
pl: Wzór manifestu ma jedną komendę na linię, gdzie każda komenda określa zbiór plików do załączenia lub wyłączenia ze źródłowej dystrybucji. Na przykład, popatrzmy na własny wzór manifestu Distutils::

source: include *.txt recursive-include examples *.txt *.py prune examples/sample?/build
pl: include *.txt recursive-include examples *.txt *.py prune examples/sample?/build - z ang -załącz pliki *.txt rekursywnie-załączaj przykłady *.txt i *.py wydmuchaj przykłady/wzory?/budowy

source: The meanings should be fairly clear: include all files in the distribution root matching :file:`\*.txt`, all files anywhere under the :file:`examples` directory matching :file:`\*.txt` or :file:`\*.py`, and exclude all directories matching :file:`examples/sample?/build`. All of this is done *after* the standard include set, so you can exclude files from the standard set with explicit instructions in the manifest template. (Or, you can use the :option:`--no-defaults` option to disable the standard set entirely.)
pl: Znaczenia powinny być raczej jasne: zawrzyj wszystkie pliki w nadrzędnym katalogu dystrybucji odpowiadające plikom :file:`\*.txt`, wszystkie pliki gdziekolwiek w katalogu :file:`examples` odpowiadające plikom :file:`\*.txt` lub :file`\*.py`, i wyłączać wszystkie katalogi pasujące do :file:`examples/sample?/build` Wszystko to dzieje się *po* standardowym zbiorze załączanym, tak że możesz wyłączyć pliki ze standardowego zbioru za pomocą jawnych instrukcji we wzorcu manifestu. Lub możesz też użyć opcji :option:`--no-defaults` aby wyłączyć standardowy zbiór całkowicie.)

source: The order of commands in the manifest template matters: initially, we have the list of default files as described above, and each command in the template adds to or removes from that list of files. Once we have fully processed the manifest template, we remove files that should not be included in the source distribution:
pl: Kolejność poleceń we wzorze manifestu ma znaczenie: początkowo, mamy listę domyślnych plików, jak opisano powyżej, i każde polecenie we wzorze dodaje lub zdejmuje z tej listy plików. Gdy mamy całkowicie przetworzony wzór manifestu, usuwamy pliki, które nie powinny znajdować się w dystrybucji źródłowej:

source: all files in the Distutils "build" tree (default :file:`build/`)
pl: wszystkie pliki w drzewie budowania Distutils (domyślne :file:`build/`)

source: all files in directories named :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` or :file:`_darcs`
pl: wszystkie pliki w katalogach nazwanych :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` or :file:`_darcs`

source: Now we have our complete list of files, which is written to the manifest for future reference, and then used to build the source distribution archive(s).
pl: Teraz mamy naszą pełną listę plików, które są zapisane w manifeście dla przyszłego odniesienia, i potem używane do budowania archiwum(ów) źródłowych dystrybucji.

source: You can disable the default set of included files with the :option:`--no-defaults` option, and you can disable the standard exclude set with :option:`--no-prune`.
pl: Możesz wyłączyć domyślny zbiór załączanych plików opcją :option:`--no-defaults` i możesz wyłączyć standardowy zbiór wyłączanych plików za pomocą opcji :option:`--no-prune`.

source: Following the Distutils' own manifest template, let's trace how the :command:`sdist` command builds the list of files to include in the Distutils source distribution:
pl: Podążając za wzorem manifestu własnego Distutils, prześledźmy jak polecenie :command:`sdist` buduje listę plików do załączenia w źródłowej dystrybucji Distutils:

source: include all Python source files in the :file:`distutils` and :file:`distutils/command` subdirectories (because packages corresponding to those two directories were mentioned in the :option:`packages` option in the setup script---see section :ref:`setup-script`)
pl: zawrzyj wszystkie pliki źródłowe języka pytonowskiego w podkatalogach :file:`distutils` i :file:`distutils/command` (ponieważ pakiety odpowiadające tym dwóm katalogom były wymienione w opcji :option:`packages` w skrypcie instalacyjnym --- zobacz paragraf :ref:`skrypt-instalacyjny` - z ang. - :ref:`setup-script`)

source: include :file:`README.txt`, :file:`setup.py`, and :file:`setup.cfg` (standard files)
pl: include :file:`README.txt`, :file:`setup.py`, and :file:`setup.cfg` (standardowe pliki)

source: include :file:`test/test\*.py` (standard files)
pl: include :file:`test/test\*.py` (standardowe pliki)

source: include :file:`\*.txt` in the distribution root (this will find :file:`README.txt` a second time, but such redundancies are weeded out later)
pl: załącz pliki :file:`\*.txt` w nadrzędnym katalogu dystrybucji (to odnajdzie plik :file:`README.txt` po raz drugi, ale takie nadmiarowości są odchwaszczane później)

source: include anything matching :file:`\*.txt` or :file:`\*.py` in the sub-tree under :file:`examples`,
pl: załącz cokolwiek pasującego do wzoru :file:`\*.txt` lub :file:`*.py` w poddrzewie pod :file:`examples`,

source: exclude all files in the sub-trees starting at directories matching :file:`examples/sample?/build`\ ---this may exclude files included by the previous two steps, so it's important that the ``prune`` command in the manifest template comes after the ``recursive-include`` command
pl: wyłącz wszystkie pliki w poddrzewach pasujące do :file:`examples/sample?/build`\ --- to może wyłączyć pliki załączone w poprzednich dwóch krokach, więc istotne jest aby polecenie ``prune`` we wzorcu manifestu następowało po poleceniu ``recursive-include``

source: exclude the entire :file:`build` tree, and any :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` and :file:`_darcs` directories
pl: wyłącz całe drzewo :file:`build`, i wszystkie katalogi :file:`RCS` :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` i :file:`_darcs`

source: Just like in the setup script, file and directory names in the manifest template should always be slash-separated; the Distutils will take care of converting them to the standard representation on your platform. That way, the manifest template is portable across operating systems.
pl: Tak jak w skrypcie instalacyjnym, nazwy plików i katalogów we wzorcu manifestu powinny zawsze być separowane-ukośnikiem; Distutils zajmie się zamianą ich na standardową postać na twojej maszynie/środowisku. W ten sposób, wzór manifestu jest przenośny pomiędzy systemami operacyjnymi.

source: Commands
pl: Polecenia

source: The manifest template commands are:
pl: Polecenia wzorca manifestu to:

source: include all files matching any of the listed patterns
pl: załącz wszystkie pliki pasujące do któregokolwiek wzorca

source: exclude all files matching any of the listed patterns
pl: wyłącz wszystkie pliki pasujące nazwą do któregokolwiek z wzorców

source: :command:`recursive-include dir pat1 pat2 ...`
pl: :command:`recursive-include kat pat1 pat2 ...`

source: include all files under *dir* matching any of the listed patterns
pl: załącz wszystkie pliki pod *kat* pasujące do któregokolwiek z wzorców

source: :command:`recursive-exclude dir pat1 pat2 ...`
pl: :command:`recursive-exclude kat pat1 pat2 ...`

source: exclude all files under *dir* matching any of the listed patterns
pl: wyłącz wszystkie pliki pod *kat* pasujące do któregokolwiek z wzorców na liście

source: include all files anywhere in the source tree matching --- & any of the listed patterns
pl: załącz wszystkie pliki gdziekolwiek w drzewie źródłowym pasujące --- do któregokolwiek z wymienionych wzorców

source: exclude all files anywhere in the source tree matching --- & any of the listed patterns
pl: wyłącz wszystkie pliki gdziekolwiek w źródłowym drzewie pasujące nazwą --- do któregokolwiek z wymienionych wzorców

source: exclude all files under *dir*
pl: wyłącz wszsytkie pliki w katalogu *dir*

source: include all files under *dir*
pl: załącz wszystkie pliki w katalogu *dir*

source: The patterns here are Unix-style "glob" patterns: ``*`` matches any sequence of regular filename characters, ``?`` matches any single regular filename character, and ``[range]`` matches any of the characters in *range* (e.g., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). The definition of "regular filename character" is platform-specific: on Unix it is anything except slash; on Windows anything except backslash or colon.
pl: Wzorce tutaj są w stylu Unix-owym "glob"-wzorcami: ``*`` dopasowuje do dowolnego ciągu zwykłych znaków nazwy pliku, ``?`` dopasowuje jeden zwykły znak nazwy pliku, a ``[zakres]`` dopasowuje którekolwiek znaki z zakresu (np. ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). Definicja "zwykłego znaku nazwy pliku" jest zależna od maszyny/środowiska: na Unix-ie to wszystko oprócz ukośnika; w Windows wszystko oprócz skośnika lub dwukropka.

source: Uploading Packages to the Package Index
pl: Wysyłanie pakietów do indeksu pakietów

source: The Python Package Index (PyPI) not only stores the package info, but also the package data if the author of the package wishes to. The distutils command :command:`upload` pushes the distribution files to PyPI.
pl: Indeks pakietów języka pytonowskiego (PyPI) nie tylko przechowuje informacje o pakietach, ale także dane pakietów jeśli autor pakietu życzy sobie tego. Polecenie distutils :command:`upload` popycha pliki dystrybucji do PyPI.

source: The command is invoked immediately after building one or more distribution files. For example, the command ::
pl: Polecenie jest wywoływane natychmiast po zbudowaniu jednego lub więcej pliku dystrybucji. Na przykład polecenie::
